Repository: Mohammedaltaher/MT-API
Catalog: *.API/Globalizations/SharedResources.*.resx
Languages: ar

# RequiredField
source: This field is required.
ar: هذا الحقل مطلوب

source: Welcome.
ar: مرحباً

# InvalidPhoneNumber
source: Invalid phone number, must be (9) digit without (0).
ar: رقم الجوال غير صحيح

# InvalidEmail
source: Invalid email address.
ar: البريد الإلكتروني غير صحيح

# LoginResponseInvalidEmailPasswordErrMsg
source: Invalid email / password.
ar: البريد الإلكتروني / كلمة المرور غير صحيحة

# LoginResponseSuccessMsg
source: User logged in successfully.
ar: تم تسجيل الدخول للنظام بنجاح

# LoginResponsePhoneConfirmationErrMsg
source: Please activate your account.
ar: يرجى تفعيل الحساب

# IdentityDefaultError
source: An unknown failure has occured.
ar: تم حصول

# UserWithEmailExists
source: A user with such email exists.
ar: البريد الالكتروني مستخدم من قبل مستحدم اخر

# ConfirmPasswordNotMatch
source: Password doesn't match
ar: كلمة المرور غير متطابقة

# IdentityErrorConcurrencyFailure
source: Concurrency failure.
ar: فشل التزامن

# IdentityErrorDefault
source: Identity system error.
ar: حدث خطأ في نظام التسجيل

# IdentityErrorDuplicateEmail
source: Email '{0}' already exists.
ar: عنوان البريد الإلكتروني '{0}' موجود مسبقاً

# IdentityErrorDuplicateRoleName
source: Role name '{0}' already exists.
ar: اسم الصلاحية '{0}' موجودة مسبقاً

# IdentityErrorDuplicateUserName
source: Username '{0}' already exists.
ar: اسم المستخدم '{0}' موجود مسبقاً

# IdentityErrorInvalidEmail
source: Email '{0}' is invalid.
ar: عنوان البريد الإلكتروني '{0}' غير صحيح

# IdentityErrorInvalidToken
source: Invalid Code.
ar: كود التحقق غير صحيح

# IdentityErrorInvalidUserName
source: Username '{0}' is invalid.
ar: اسم المستخدم '{0}' غير صحيح

# IdentityErrorPasswordMismatch
source: The provided password doesn't match your saved password.
ar: كلمة المرور غير متطابقة

# IdentityErrorPasswordRequiresDigit
source: The password must contain digits (0 - 9).
ar: يجب أن تحتوي كلمة المرور علي أرقام (0 - 9)

# IdentityErrorPasswordRequiresLower
source: The password must contain lower case letters (a - z).
ar: يجب أن تحتوي كلمة المرور علي أحرف صغيرة (a - z)

# IdentityErrorPasswordRequiresNonAlphanumeric
source: The password must contain non-alphanumeric character
ar: يجب أن تحتوي كلمة المرور علي رموز غير أحرف - أرقام (. ! + ? ...)

# IdentityErrorPasswordRequiresUniqueChars
source: The password must contain '{0}' unique character
ar: يجب أن تحتوي كلمة المرور '{0}' علي أحرف غير متشابهة علي الأقل

# IdentityErrorPasswordRequiresUpper
source: The password must contain upper case letters (A - Z).
ar: يجب أن تحتوي كلمة المرور علي أحرف كبيرة

# IdentityErrorPasswordTooShort
source: The password must be al least '{0}' character long.
ar: يجب أن تكون كلمة المرور '{0}' أحرف علي الأقل

# IdentityErrorRecoveryCodeRedemptionFailed
source: Recovery code was not redeemed.
ar: لم يتم استعمال رمز الاسترجاع

# IdentityErrorUserAlreadyHasPassword
source: User already has a password
ar: المستخدم يمكتلك كلمة السر في حسابه مسبقاَ

# IdentityErrorUserAlreadyInRole
source: The user is already in '{0}' role.
ar: المستخدم لديه صلاحية '{0}' مسبقاً

# IdentityErrorUserLockoutNotEnabled
source: User lockout is not enabled.
ar: قفل المستخدم غير فعال

source: Incorrect password
ar: كلمة المرور غير صحيحة

# VerificationCodeSuccessfully
source: Verification code has been sent successfully
ar: تم إرسال كود التحقق بنجاح

# RegisterUserResponseErrMsg
source: Unable to create account. Please check the following:
ar: تغذر إنشاء الحساب الرجاء مراجعة البيانات أدناه

source: Password reset token sent successfully.
ar: تم إرسال كود التحقق بنجاح

# LoginResponseDisabledAccountErrMsg
source: Your account has been disabled, please contact the technical support team for more information
ar: تم تعطيل حسابك، يرجي التواصل مع فريق الدعم الفني للمزيد من المعلومات

# LoginResponseUnauthorizedUserErrMsg
source: You do not have an account, please register an account
ar: ليس لديك حساب، يرجى تسجيل حساب

# PasswordResetResponseErrMsg
source: Unable to rest the password, Please check the following:
ar: تعذر تغيير كلمة المرور, يرجى مراجعة البيانات أدناة:

# PasswordRestResponseSuccessMsg
source: Your password has been updated successfully.
ar: تم تغيير كلمة المرور بنجاح

# PasswordRestTokenInvalid
source: Invalid password rest token.
ar: كود التحقق المدخل غير صحيح.

# GeneralRequestValidationError
source: Please check the following:
ar: يرجي التحقق من البيانات أدناه:

# RegisterAccountSentVerificationSuccessMsg
source: Your account has been created successfully, please activate it
ar: تم إنشاء الحساب بنجاح, يرجى تفعيل الحساب بإدخال كود التحقق المرسل إلي هاتفك

# RegisterAccountVerifyTokenErrMsg
source: Unable to verify your account, please check the following:
ar: تعذر تفعيل الحساب, يرحي مراجعة البيانات أدناه:

source: Invalid IBAN
ar: رقم الآيبان غير صحيح

# LoginResponsePhoneConfirmationMsgSentErrMsg
source: Unable to send confirmation code, please try again.
ar: تعذر إرسال كود التحقق, يرجي إعادة الارسال لتفعيل الحساب

# YakkenClientVehicleResponseValidationErrMsg
source: Please check the vehicle sequance number and the vehicle owner identification number
ar: يرجى التحقق من الرقم التسلسلي للمركبة ورقم الهوية لمالك المركبة

# YakkenInsuredResponseGlobalErrMsg
source: An error occurred during the process of querying insured data from the National Information Center
ar: حدث خطأ أثناء عملية الاستعلام عن بيانات المؤمن له من مركز المعلومات الوطني

# YakkenInsuredResponseValidationErrMsg
source: Please check the ID number and date of birth of the insured
ar: يرجى التحقق من رقم الهوية وتاريخ الميلاد للمؤمن له

# YakkenSaudiPostResponseValidationErrMsg
source: Please check the ID number and you are registered at the National Address Service
ar: يرجى التحقق من رقم الهوية للمؤمن له وأنه مسجل في خدمة العنوان الوطني

# YakkenDriverResponseGlobalErrMsg
source: An error occurred during the process of querying additional driver data from the National Information Center
ar: حدث خطأ أثناء عملية الاستعلام عن بيانات السائق الإضافي من مركز المعلومات الوطني

# YakkenDriverResponseValidationErrMsg
source: Please check the ID number and date of birth of the additional driver
ar: يرجى التحقق من رقم الهوية وتاريخ الميلاد للسائق الإضافي

# Permission.Create.Account
source: Create Account
ar: انشاء حساب

# Permission.Manage.Identity
source: Manage Identity
ar: ادارة الصلاحيات

# Permission.Manage.Policies
source: Manage Policies
ar: ادارة الوثائيق

# Permission.Update.Account
source: Update Account
ar: تحديث الحسابات

# Permission.Update.Clients.Details
source: Update Clients Details
ar: تحديث تفاصيل العملاء

# Permission.View.API.Logger
source: View API Logger
ar: عرض السجلات

# Permission.View.Clients.Accounts
source: View Clients Accounts
ar: عرض حسابات العملاء

# Permission.View.Clients.Details
source: View Clients Details
ar: عرض تفاصيل العملاء

# Permission.View.Employees.Accounts
source: View Employees Accounts
ar: عرض حسابات الموظفين

# Permission.View.Policies
source: View Policies
ar: عرض الوثئيق

# Permission.View.Quotations
source: View Quotations
ar: عرض عروض الاسعار
